rho = 979;           # 油的密度
g   = 9.794;         # 重力加速度
eta = 1.83e-5;       # 空气粘滞系数
l   = 1.6e-3;        # 油滴匀速下降距离
b   = 6.17e-6;       # 修正常数
P   = 76;            # 大气压强
d   = 5e-3;          # 平行极板距离
e0  = 1.6021773e-19; # 电子电量公认值

# 平衡电压
U   = [134, 134, 134, 134, 134];

# 下落时间
tg  = [20.07, 18.84, 19.18, 19.22, 19.60];

mean(U)              # 平衡电压均值
mean(tg)             # 下降时间均值
vg  = l / mean(tg);  # 匀速下落的速度

a   = sqrt((9*eta*vg) / (2*g*rho));
a   = sqrt((9*eta*vg) / (2*g*rho) * (1 / (1+b/(P*a))));  # 修正
m   = 4/3 * pi * a^3 * rho;
q   = m * g * d / mean(U)  # 油滴所带的电荷量

n   = round(q / e0)       # 近似整数
ei  = q / n               # 电子电量实验值

# 实验数据 (U, tg)
# 1. [43, 43, 43, 43, 43] [20.66, 19.86, 20.46, 20.65, 20.08]
# 2. [72, 72, 72, 72, 72] [16.50, 16.58, 16.20, 16.40, 16.57]
# 3. [134, 134, 134, 134, 134] [20.07, 18.84, 19.18, 19.22, 19.60]
# 4. [74, 74, 74, 74, 74] [17.27, 17.35, 17.60, 17.75, 17.65]
